//
//  Localizable.strings
//  Stats
//
//  Created by Patrik Persson on 04/01/2025.
//  Using Swift 5.0.
//  Running on macOS 15.
//
//  Copyright © 2020 Serhiy Mytrovtsiy. All rights reserved.
//

// Modules
"CPU" = "CPU";
"Open CPU settings" = "Öppna CPU-inställningar";
"GPU" = "GPU";
"Open GPU settings" = "Öppna GPU-inställningar";
"RAM" = "RAM";
"Open RAM settings" = "Öppna RAM-inställningar";
"Disk" = "Hårddisk"; // translategemma:4b
"Open Disk settings" = "Öppna diskinställningar";
"Sensors" = "Sensorer";
"Open Sensors settings" = "Öppna sensorinställningar";
"Network" = "Nätverk";
"Open Network settings" = "Öppna nätverksinställningar";
"Battery" = "Batteri";
"Open Battery settings" = "Öppna batteriinställningar";
"Bluetooth" = "Bluetooth";
"Open Bluetooth settings" = "Öppna Bluetooth-inställningar";
"Clock" = "Klocka";
"Open Clock settings" = "Öppna klockinställningar";

// Words
"Unknown" = "Okänd";
"Version" = "Version";
"Processor" = "Processor";
"Memory" = "Minne";
"Graphics" = "Grafik";
"Close" = "Stäng";
"Download" = "Ladda ner";
"Install" = "Installera";
"Cancel" = "Avbryt";
"Unavailable" = "Ej tillgänglig";
"Yes" = "Ja";
"No" = "Nej";
"Automatic" = "Automatisk";
"Manual" = "Manuell";
"None" = "Ingen";
"Dots" = "Punkter";
"Arrows" = "Pilar";
"Characters" = "Tecken";
"Short" = "Kort";
"Long" = "Lång";
"Statistics" = "Statistik";
"Max" = "Max";
"Min" = "Mitt"; // translategemma:4b
"Reset" = "Återställ";
"Alignment" = "Justering";
"Left alignment" = "Vänster";
"Center alignment" = "Centrerad";
"Right alignment" = "Höger";
"Dashboard" = "Instrumentpanel";
"Enabled" = "Aktiverad";
"Disabled" = "Inaktiverad";
"Silent" = "Tyst";
"Units" = "Enheter";
"Fans" = "Fläktar";
"Scaling" = "Skalning";
"Linear" = "Linjär";
"Square" = "Kvadratisk";
"Cube" = "Kubisk";
"Logarithmic" = "Logaritmisk";
"Fixed scale" = "Fast skala";
"Cores" = "Kärnor";
"Settings" = "Inställningar";
"Name" = "Namn";
"Format" = "Format";
"Turn off" = "Stäng av";
"Normal" = "Normal";
"Warning" = "Varning";
"Critical" = "Kritisk";
"Usage" = "Användning";
"2 minutes" = "2 minuter";
"3 minutes" = "3 minuter";
"10 minutes" = "10 minuter";
"Import" = "Importera";
"Export" = "Exportera";
"Separator" = "Avgränsare";
"Read" = "Läs";
"Write" = "Skriv";
"Frequency" = "Frekvens";
"Save" = "Spara"; // translategemma:4b
"Run" = "Kör"; // translategemma:4b
"Stop" = "Stopp"; // translategemma:4b
"Uninstall" = "Avinstallera"; // translategemma:4b
"1 sec" = "1 sekund"; // translategemma:4b
"2 sec" = "2 sekunder"; // translategemma:4b
"3 sec" = "3 sekunder"; // translategemma:4b
"5 sec" = "5 sekunder"; // translategemma:4b
"10 sec" = "10 sek"; // translategemma:4b
"15 sec" = "15 sek"; // translategemma:4b
"30 sec" = "30 sekunder"; // translategemma:4b
"60 sec" = "60 sekunder"; // translategemma:4b

// Setup
"Stats Setup" = "Stats-installation";
"Previous" = "Föregående";
"Previous page" = "Föregående sida";
"Next" = "Nästa";
"Next page" = "Nästa sida";
"Finish" = "Avsluta";
"Finish setup" = "Avsluta installationen";
"Welcome to Stats" = "Välkommen till Stats";
"welcome_message" = "Tack för att du använder Stats, ett gratis och öppen källkod macOS-systemövervakningsverktyg för din menyrad.";
"Start the application automatically when starting your Mac" = "Starta applikationen automatiskt när du startar din Mac";
"Do not start the application automatically when starting your Mac" = "Starta inte applikationen automatiskt när du startar din Mac";
"Do everything silently in the background (recommended)" = "Gör allt tyst i bakgrunden (rekommenderas)";
"Check for a new version on startup" = "Kontrollera efter en ny version vid uppstart";
"Check for a new version every day (once a day)" = "Kontrollera efter en ny version varje dag (en gång om dagen)";
"Check for a new version every week (once a week)" = "Kontrollera efter en ny version varje vecka (en gång i veckan)";
"Check for a new version every month (once a month)" = "Kontrollera efter en ny version varje månad (en gång i månaden)";
"Never check for updates (not recommended)" = "Kontrollera aldrig efter uppdateringar (rekommenderas inte)";
"Anonymous telemetry for better development decisions" = "Anonym telemetri för bättre utvecklingsbeslut";
"Share anonymous telemetry data" = "Dela anonym telemetridata";
"Do not share anonymous telemetry data" = "Dela inte anonym telemetridata";
"The configuration is completed" = "Konfigurationen är slutförd";
"finish_setup_message" = "Allt är inställt! \n Stats är ett verktyg med öppen källkod, det är gratis och kommer alltid att vara det. \n Om du gillar det kan du stödja projektet, det uppskattas alltid!";

// Alerts
"New version available" = "Ny version tillgänglig";
"Click to install the new version of Stats" = "Klicka för att installera den nya versionen av Stats";
"Successfully updated" = "Uppdateringen lyckades";
"Stats was updated to v" = "Stats uppdaterades till v%0";
"Reset settings text" = "Alla programinställningar kommer att återställas och programmet startas om. Är du säker på att du vill göra detta?";
"Support text" = "Tack för att du använder Stats!\n\n Att underhålla och förbättra detta projekt med öppen källkod tar tid och resurser. Ditt stöd hjälper oss att fortsätta tillhandahålla en gratis och tillförlitlig applikation för alla.\n\nOm du tycker att Stats är användbart kan du överväga att ge ett bidrag. Varje liten bit hjälper!";

// Settings
"Open Activity Monitor" = "Öppna Aktivitetsövervakaren";
"Report a bug" = "Rapportera en bugg";
"Support the application" = "Stöd Stats";
"Close application" = "Stäng applikationen";
"Open application settings" = "Öppna applikationsinställningar";
"Open dashboard" = "Öppna instrumentpanelen";
"No notifications available in this module" = "Inga notifikationer tillgängliga i denna modul";
"Open Calendar" = "Öppna Kalender";
"Toggle the module" = "Aktivera/inaktivera modulen"; // translategemma:4b

// Application settings
"Update application" = "Uppdatera applikationen";
"Check for updates" = "Sök efter uppdateringar";
"At start" = "Vid start";
"Once per day" = "En gång per dag";
"Once per week" = "En gång per vecka";
"Once per month" = "En gång per månad";
"Never" = "Aldrig";
"Check for update" = "Sök efter uppdatering";
"Show icon in dock" = "Visa ikon i Dock";
"Start at login" = "Starta vid inloggning";
"Build number" = "Byggnummer";
"Import settings" = "Importera inställningar";
"Export settings" = "Exportera inställningar";
"Reset settings" = "Återställ inställningar";
"Pause the Stats" = "Pausa Stats";
"Resume the Stats" = "Återuppta Stats";
"Combined modules" = "Kombinerade moduler";
"Combined details" = "Kombinerade detaljer";
"Spacing" = "Mellanrum";
"Share anonymous telemetry" = "Dela anonym telemetri";
"Choose file" = "Välj fil"; // translategemma:4b
"Stress tests" = "Spänningstester"; // translategemma:4b

// Dashboard
"Serial number" = "Serienummer";
"Model identifier" = "Modellidentifierare";
"Production year" = "Tillverkningsår";
"Uptime" = "Upptid";
"Number of cores" = "%0 kärnor";
"Number of threads" = "%0 trådar";
"Number of e-cores" = "%0 effektivitetskärnor";
"Number of p-cores" = "%0 prestandakärnor";
"Disks" = "Skivor"; // translategemma:4b
"Display" = "Visning"; // translategemma:4b

// Update
"The latest version of Stats installed" = "Den senaste versionen av Stats är installerad";
"Downloading..." = "Laddar ner...";
"Current version: " = "Nuvarande version:  ";
"Latest version: " = "Senaste version:    ";

// Widgets
"Color" = "Färg";
"Label" = "Etikett";
"Box" = "Låda";
"Frame" = "Ram";
"Value" = "Värde";
"Colorize" = "Färglägg";
"Colorize value" = "Färglägg värde";
"Additional information" = "Mer information";
"Reverse values order" = "Växla ordning";
"Base" = "Enhet";
"Display mode" = "Visningsläge";
"One row" = "En rad";
"Two rows" = "Två rader";
"Mini widget" = "Mini";
"Line chart widget" = "Linjediagram";
"Bar chart widget" = "Stapeldiagram";
"Pie chart widget" = "Cirkeldiagram";
"Network chart widget" = "Nätverksdiagram";
"Speed widget" = "Hastighet";
"Battery widget" = "Batteri";
"Stack widget" = "Stack";
"Memory widget" = "Minne";
"Static width" = "Fast bredd";
"Tachometer widget" = "Varvräknare";
"State widget" = "Statwidget";
"Text widget" = "Textwidget"; // translategemma:4b
"Battery details widget" = "Widget för batteriinformation"; // translategemma:4b
"Show symbols" = "Visa symboler";
"Label widget" = "Etikett";
"Number of reads in the chart" = "Antal avläsningar i diagrammet";
"Color of download" = "Färg för nedladdning";
"Color of upload" = "Färg för uppladdning";
"Monospaced font" = "Monospace-typsnitt";
"Reverse order" = "Omvänd ordning";
"Chart history" = "Diagramhistorik";
"Default color" = "Standardfärg";
"Transparent when no activity" = "Genomskinlig vid inaktivitet";
"Constant color" = "Konstant färg";

// Module Kit
"Open module settings" = "Öppna modulinställningar";
"Select widget" = "Välj %0 widget";
"Open widget settings" = "Öppna widgetinställningar";
"Update interval" = "Uppdateringsintervall";
"Usage history" = "Användningshistorik";
"Details" = "Detaljer";
"Top processes" = "Topprocesser";
"Pictogram" = "Piktogram";
"Module" = "Modul";
"Widgets" = "Widgetar"; // translategemma:4b
"Popup" = "Popup";
"Notifications" = "Notifikationer";
"Merge widgets" = "Slå samman widgets";
"No available widgets to configure" = "Inga tillgängliga widgets att konfigurera";
"No options to configure for the popup in this module" = "Inga alternativ att konfigurera för popup-fönstret i denna modul";
"Process" = "Process";
"Kill process" = "Avsluta process";
"Keyboard shortcut" = "Tangentbordsgenväg"; // translategemma:4b
"Listening..." = "Lyssna..."; // translategemma:4b

// Modules
"Number of top processes" = "Antal topprocesser";
"Update interval for top processes" = "Uppdateringsintervall för topprocesser";
"Notification level" = "Notisnivå";
"Chart color" = "Diagramfärg";
"Main chart scaling" = "Huvuddiagramskalning";
"Scale value" = "Skalvärde";
"Text widget value" = "Värdet för textwidget"; // translategemma:4b

// CPU
"CPU usage" = "CPU-användning";
"CPU temperature" = "CPU-temperatur";
"CPU frequency" = "CPU-frekvens";
"System" = "System";
"User" = "Användare";
"Idle" = "Overksam";
"Show usage per core" = "Visa användning per kärna";
"Show hyper-threading cores" = "Visa hypertrådskärnor";
"Split the value (System/User)" = "Dela upp värdet (System/Användare)";
"Scheduler limit" = "Schemaläggargräns";
"Speed limit" = "Hastighetsbegränsning";
"Average load" = "Genomsnittlig belastning";
"1 minute" = "1 minut";
"5 minutes" = "5 minuter";
"15 minutes" = "15 minuter";
"CPU usage threshold" = "Tröskelvärde för CPU-användning";
"CPU usage is" = "CPU-användningen är %0";
"Efficiency cores" = "Effektivitetskärnor";
"Performance cores" = "Prestandakärnor";
"System color" = "Systemfärg";
"User color" = "Användarfärg";
"Idle color" = "Overksamhetsfärg";
"Cluster grouping" = "Klustergruppering";
"Efficiency cores color" = "Effektivitetskärnors färg";
"Performance cores color" = "Prestandakärnors färg";
"Total load" = "Total belastning";
"System load" = "Systembelastning";
"User load" = "Användarbelastning";
"Efficiency cores load" = "Effektivitetskärnors belastning";
"Performance cores load" = "Prestandakärnors belastning";
"All cores" = "Alla kärnor";

// GPU
"GPU to show" = "GPU att visa";
"Show GPU type" = "Visa GPU-typ";
"GPU enabled" = "GPU aktiverad";
"GPU disabled" = "GPU inaktiverad";
"GPU temperature" = "GPU-temperatur";
"GPU utilization" = "GPU-användning";
"Vendor" = "Tillverkare";
"Model" = "Modell";
"Status" = "Status";
"Active" = "Aktiv";
"Non active" = "Inaktiv";
"Fan speed" = "Fläkthastighet";
"Core clock" = "Kärnklocka";
"Memory clock" = "Minnesklocka";
"Utilization" = "Användning";
"Render utilization" = "Render-användning";
"Tiler utilization" = "Tiler-användning";
"GPU usage threshold" = "Tröskelvärde för GPU-användning";
"GPU usage is" = "GPU-användningen är %0";

// RAM
"Memory usage" = "Minnesanvändning";
"Memory pressure" = "Minnestryck";
"Total" = "Totalt";
"Used" = "Använt";
"App" = "Appminne";
"Wired" = "Resident minne";
"Compressed" = "Komprimerat";
"Free" = "Ledigt";
"Swap" = "Växling";
"Split the value (App/Wired/Compressed)" = "Dela upp värdet (App/Resident/Komprimerat)";
"RAM utilization threshold" = "Tröskelvärde för minnesanvändning";
"RAM utilization is" = "Minnesanvändningen är %0";
"App color" = "Appfärg";
"Wired color" = "Resident minnesfärg";
"Compressed color" = "Komprimerat minnesfärg";
"Free color" = "Ledigt minnesfärg";
"Free memory (less than)" = "Ledigt minne (mindre än)";
"Swap size" = "Växlingsstorlek";
"Free RAM is" = "Ledigt RAM är %0";

// Disk
"Show removable disks" = "Visa flyttbara diskar";
"Used disk memory" = "%0 av %1 används";
"Free disk memory" = "%0 av %1 ledigt";
"Disk to show" = "Disk att visa";
"Open disk" = "Öppna disk";
"Switch view" = "Växla vy";
"Disk utilization threshold" = "Tröskelvärde för diskanvändning";
"Disk utilization is" = "Diskanvändningen är %0";
"Read color" = "Läsfärg";
"Write color" = "Skrivfärg";
"Disk usage" = "Diskanvändning";
"Total read" = "Totalt läst";
"Total written" = "Totalt skrivet";
"Write speed" = "Skriv";
"Read speed" = "Läs";
"Drives" = "Drivs"; // translategemma:4b
"SMART data" = "SMART-data"; // translategemma:4b

// Sensors
"Temperature unit" = "Temperaturenhet";
"Celsius" = "Celsius";
"Fahrenheit" = "Fahrenheit";
"Save the fan speed" = "Spara fläkthastighet";
"Fan" = "Fläkt";
"HID sensors" = "HID-sensorer";
"Synchronize fan's control" = "Synkronisera fläktkontroll";
"Current" = "Ström";
"Energy" = "Energi";
"Show unknown sensors" = "Visa okända sensorer";
"Install fan helper" = "Installera fläkthjälpare";
"Uninstall fan helper" = "Avinstallera fläkthjälpare";
"Fan value" = "Fläktvärde";
"Turn off fan" = "Stäng av fläkt";
"You are going to turn off the fan. This is not recommended action that can damage your mac, are you sure you want to do that?" = "Du håller på att stänga av fläkten. Detta är en inte rekommenderad åtgärd som kan skada din Mac, är du säker på att du vill göra detta?";
"Sensor threshold" = "Sensortröskel";
"Left fan" = "Vänster";
"Right fan" = "Höger";
"Fastest fan" = "Snabbaste";
"Sensor to show" = "Sensor för att visa"; // translategemma:4b

// Network
"Uploading" = "Uppladdning";
"Downloading" = "Nedladdning";
"Public IP" = "Publik IP";
"Local IP" = "Lokal IP";
"Interface" = "Gränssnitt";
"Physical address" = "Fysisk adress";
"Refresh" = "Uppdatera";
"Click to copy public IP address" = "Klicka för att kopiera publik IP-adress";
"Click to copy local IP address" = "Klicka för att kopiera lokal IP-adress";
"Click to copy wifi name" = "Klicka för att kopiera wifi-namn";
"Click to copy mac address" = "Klicka för att kopiera MAC-adress";
"No connection" = "Ingen anslutning";
"Network interface" = "Nätverksgränssnitt";
"Total download" = "Totalt nedladdat";
"Total upload" = "Totalt uppladdat";
"Reader type" = "Läsartyp";
"Interface based" = "Gränssnittsbaserad";
"Processes based" = "Processbaserad";
"Reset data usage" = "Återställ dataanvändning";
"VPN mode" = "VPN-läge";
"Standard" = "Standard";
"Security" = "Säkerhet";
"Channel" = "Kanal";
"Common scale" = "Gemensam skala";
"Autodetection" = "Autodetektering";
"Widget activation threshold" = "Widgetaktiveringströskel";
"Internet connection" = "Internetanslutning";
"Active state color" = "Aktivt tillståndsfärg";
"Nonactive state color" = "Inaktivt tillståndsfärg";
"Connectivity host (ICMP)" = "Anslutningsvärd (ICMP)";
"Leave empty to disable the check" = "Lämna tomt för att inaktivera kontrollen";
"Connectivity history" = "Anslutningshistorik";
"Auto-refresh public IP address" = "Uppdatera publik IP-adress automatiskt";
"Every hour" = "Varje timme";
"Every 12 hours" = "Var 12:e timme";
"Every 24 hours" = "Var 24:e timme";
"Network activity" = "Nätverksaktivitet";
"Last reset" = "Senaste återställning %0 sedan";
"Latency" = "Fördröjning";
"Upload speed" = "Uppladdning";
"Download speed" = "Nedladdning";
"Address" = "Adress"; // translategemma:4b
"WiFi network" = "WiFi-nätverk"; // translategemma:4b
"Local IP changed" = "Det lokala IP-adressen har ändrats"; // translategemma:4b
"Public IP changed" = "Den publika IP-adressen har ändrats"; // translategemma:4b
"Previous IP" = "Tidigare IP-adress: %0"; // translategemma:4b
"New IP" = "Ny IP-adress: %0"; // translategemma:4b
"Internet connection lost" = "Förlorad internetanslutning"; // translategemma:4b
"Internet connection established" = "Internetanslutning etablerad"; // translategemma:4b

// Battery
"Level" = "Nivå";
"Source" = "Källa";
"AC Power" = "Nätström";
"Battery Power" = "Batteri";
"Time" = "Tid";
"Health" = "Hälsa";
"Amperage" = "Strömstyrka";
"Voltage" = "Spänning";
"Cycles" = "Cyklar";
"Temperature" = "Temperatur";
"Power adapter" = "Strömadapter";
"Power" = "Effekt";
"Is charging" = "Laddar";
"Time to discharge" = "Tid till urladdning";
"Time to charge" = "Tid till fulladdning";
"Calculating" = "Beräknar";
"Fully charged" = "Fulladdad";
"Not connected" = "Ej ansluten";
"Low level notification" = "Låg nivånotis";
"High level notification" = "Hög nivånotis";
"Low battery" = "Lågt batteri";
"High battery" = "Högt batteri";
"Battery remaining" = "%0% kvar";
"Battery remaining to full charge" = "%0% till fulladdning";
"Percentage" = "Procent";
"Percentage and time" = "Procent och tid";
"Time and percentage" = "Tid och procent";
"Time format" = "Tidsformat";
"Hide additional information when full" = "Dölj extra information när fulladdad";
"Last charge" = "Senaste laddning";
"Capacity" = "Kapacitet";
"current / maximum / designed" = "nuvarande / maximal / ursprunglig";
"Low power mode" = "Lågeffektläge";
"Percentage inside the icon" = "Procent inuti ikonen";
"Colorize battery" = "Färglägg batteri";
"Charging current" = "Laddningsström";
"Charging Voltage" = "Laddningsspänning";
"Charger state inside the battery" = "Laddningsstatus inuti batteriet"; // translategemma:4b

// Bluetooth
"Battery to show" = "Batteri att visa";
"No Bluetooth devices are available" = "Inga Bluetooth-enheter tillgängliga";

// Clock
"Time zone" = "Tidszon";
"Local" = "Lokal";
"Calendar" = "Kalender";
"Show week numbers" = "Visa veknummer"; // translategemma:4b
"Local time" = "Lokal tid";
"Add new clock" = "Lägg till en ny klocka"; // translategemma:4b
"Delete selected clock" = "Ta bort vald klocka"; // translategemma:4b
"Help with datetime format" = "Hjälp med att formatera datum och tid"; // translategemma:4b

// Colors
"Based on utilization" = "Baserat på användning";
"Based on pressure" = "Baserat på tryck";
"Based on cluster" = "Baserat på kluster";
"System accent" = "Systemets accent";
"Monochrome accent" = "Svartvit accent";
"Clear" = "Genomskinlig";
"White" = "Vit";
"Black" = "Svart";
"Gray" = "Grå";
"Second gray" = "Alternativ grå";
"Dark gray" = "Mörkgrå";
"Light gray" = "Ljusgrå";
"Red" = "Röd";
"Second red" = "Alternativ röd";
"Green" = "Grön";
"Second green" = "Alternativ grön";
"Blue" = "Blå";
"Second blue" = "Alternativ blå";
"Yellow" = "Gul";
"Second yellow" = "Alternativ gul";
"Orange" = "Orange";
"Second orange" = "Alternativ orange";
"Purple" = "Lila";
"Second purple" = "Alternativ lila";
"Brown" = "Brun";
"Second brown" = "Alternativ brun";
"Cyan" = "Cyan";
"Magenta" = "Magenta";
"Pink" = "Rosa";
"Teal" = "Turkos";
"Indigo" = "Indigo";
